#+STARTUP: overview

*** 8.2
/Giv en algoritme der finder et maksimalt delarray i A i $O(n^2)$ tid. Hint: Vis at man kan beregne summerne for alle delarrays i $O(1)$ tid per delarray./

Om vi istället för att beräkna varje delarray från A[i]..A[j], så kan vi istället bara ta bort värdet av A[i-1] och lägga till värdet A[j] till en sum variabel.

För en subarray på length n så är det totalt n beräkningar för samtliga subarrays av längd n.

Vi gör detta n gånger, för subarrays av längd 1 till n.

För en subarray på längd 1, så kör for loopen med variabeln k bara 1 gång, men den med variabel j kör n gånger. Det blir omvänt för en subarray på längd n.



#+begin_src C
#include <stdio.h>

struct pointers {
    int left;
    int right;
};

struct pointers findMaxSubarray(int* A, int n)
{
    struct pointers p;
    p.left = 0;
    p.right = 0;
    int max = A[0];

    // 2
    for (int i = 1; i <= n; i++) {
        int sum = 0;
        for (int j = 0; i + j <= n; j++) {
            if (j == 0) {
                for (int k = 0; k < i; k++) {
                    sum += A[j + k];
                }
            } else {
                sum -= A[j - 1];
                sum += A[i + j - 1];
            }
            if (sum > max) {
                p.left = j;
                p.right = j + i - 1;
                max = sum;
            }
        }
        sum = 0;
    }
    return p;
}

int main()
{
    int A[] = { 1001, 0, 0, 0, 1000 };
    int A_size = sizeof(A) / sizeof(A[0]);
    int l = 0;
    int r = A_size - 1;
    struct pointers p = findMaxSubarray(A, A_size);

    printf("Left: %d\n", p.left);
    printf("Right: %d\n", p.right);

    return 0;
}

#+end_src

#+RESULTS:
| Left:  | 0 |
| Right: | 4 |

**** 5.1 Implementér en stak der kan indeholde heltal ved hjælp af en enkelt-hægtet liste.
#+CAPTION: Stack implementation
#+name: Stack with linked list
#+begin_src js :results output
function Node(val, next){
    this.val = val;
    this.next = next;
}

function Stack(){
    this.sentinel = new Node(null, null)
    this.pop = () => {
        let val = this.sentinel.next.val;
        this.sentinel.next = this.sentinel.next.next
        return val;
    }
    this.push = (val) => {
        const node = new Node(val, this.sentinel.next);
        this.sentinel.next = node;
    }
}

let stack = new Stack();
stack.push(3);
console.log(stack.sentinel)
stack.push(5);
console.log(stack.sentinel)
let val = stack.pop();
console.log("popped:", val)
console.log(stack.sentinel);
#+end_src

#+RESULTS: Stack with linked list
: Node { val: null, next: Node { val: 3, next: null } }
: Node {
:   val: null,
:   next: Node { val: 5, next: Node { val: 3, next: null } }
: }
: popped: 5
: Node { val: null, next: Node { val: 3, next: null } }

**** 5.2 Implementér en kø der kan indeholde heltal ved hjælp af en enkelt-hægtet liste.
#+CAPTION: Queue implementation
#+name: Queue with linked list
#+begin_src js :results output :exports both
function Node(val, next){
    this.val = val;
    this.next = next;
}

function Queue(){
    this.sentinel = new Node(null, null)
    this.end = this.sentinel;

    this.dequeue = () => {
        let node = this.sentinel;
        while(node.next.next != null){
            node = node.next;
        }
        let val = node.next.val;
        node.next = null;
        return val;
    }
    this.enqueue = (val) => {
        const node = new Node(val, this.sentinel.next);
        this.sentinel.next = node;
    }
}

let queue = new Queue();

queue.enqueue(3);
console.log(queue.sentinel)
queue.enqueue(5);
console.log(queue.sentinel)
let val = queue.dequeue();
console.log("dequeueing:", val)
console.log(queue.sentinel);
#+end_src

#+RESULTS: Queue with linked list
: Node { val: null, next: Node { val: 3, next: null } }
: Node {
:   val: null,
:   next: Node { val: 5, next: Node { val: 3, next: null } }
: }
: dequeueing: 3
: Node { val: null, next: Node { val: 5, next: null } }

*** 7
Vi skal ha styr pa x.next og x.next.next. Vi peger x.next pa x og sa gentager vi processen, men nu er x.next den som er x.
#+CAPTION: Turn linked list
#+name: Turn linked list
#+begin_src js :results output :exports both
function Node(val, next){
    this.val = val;
    this.next = next;
}

function reverseLinkedList(node){
    let prevNode = null;
    let nextNode = node.next;
    while(nextNode != null){
        node.next = prevNode;
        prevNode = node;
        node = nextNode;
    }
}


let z = new Node(3, null);
let y = new Node(44, z);
let x = new Node(-7, y);
reverseLinkedList(x)
console.log(z)



#+end_src

#+RESULTS: Turn linked list
: Node { val: 3, next: null }



